In [1]:
import numpy as np
import pandas as pd
data=pd.Series([1,2,3,4,5,6])
data

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [2]:
data.values

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [3]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [4]:
data[2]

3

In [5]:
data[1:4]

1    2
2    3
3    4
dtype: int64

In [6]:
dt=pd.Series([1,2,3,4,5,6], index=['a','b','c','d','e','f'])
dt

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [7]:
np.exp(dt)

a      2.718282
b      7.389056
c     20.085537
d     54.598150
e    148.413159
f    403.428793
dtype: float64

In [8]:
dt['a']

1

In [9]:
dt1=pd.Series(['@',2,3,4,5,6], index=['a','b','c','d','e','f'])
dt1

a    @
b    2
c    3
d    4
e    5
f    6
dtype: object

In [10]:
dt1['a':'e']   # can't be done if duplicate index

a    @
b    2
c    3
d    4
e    5
dtype: object

In [11]:
dt1[1:4]

b    2
c    3
d    4
dtype: object

In [12]:
dt1['a']

'@'

In [13]:
population_dict = {'California': 38332521,
 'Texas': 26448193,
 'New York': 19651127,
 'Florida': 19552860,
 'Illinois': 12882135}

In [14]:
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [15]:
population['Texas']

26448193

In [16]:
pd.Series(5,index=[10,20,30])

10    5
20    5
30    5
dtype: int64

In [17]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [18]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

In [19]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=['a', 'k'])

a    NaN
k    NaN
dtype: object

In [20]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
 'Florida': 170312, 'Illinois': 149995}

In [21]:
area=pd.Series(area_dict)
area
#area[2]

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [22]:
states=pd.DataFrame({'Population':population,'Area':area})
states

            Population    Area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [23]:
states['Density']=states['Population']/states['Area']
states

            Population    Area     Density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [24]:
states['Area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: Area, dtype: int64

In [25]:
states['Area']['Texas']

695662

In [26]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [27]:
states.columns

Index(['Population', 'Area', 'Density'], dtype='object')

In [28]:
pd.DataFrame(population,columns=['Population'])

            Population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [29]:
states.values

array([[3.83325210e+07, 4.23967000e+05, 9.04139261e+01],
       [2.64481930e+07, 6.95662000e+05, 3.80187404e+01],
       [1.96511270e+07, 1.41297000e+05, 1.39076746e+02],
       [1.95528600e+07, 1.70312000e+05, 1.14806121e+02],
       [1.28821350e+07, 1.49995000e+05, 8.58837628e+01]])

In [30]:
states.values[1]

array([2.64481930e+07, 6.95662000e+05, 3.80187404e+01])

In [31]:
states.T

,California,Texas,New York,Florida,Illinois
Population,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
Area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
Density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

In [32]:
states.iloc[:3, :2]        #[Row,Col]

            Population    Area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297

In [33]:
states.loc[:'New York', :'Area']

            Population    Area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297

In [34]:
states.loc[:'New York',[ 'Area','Density']]

              Area     Density
California  423967   90.413926
Texas       695662   38.018740
New York    141297  139.076746

In [35]:
states['Density']>100

California    False
Texas         False
New York       True
Florida        True
Illinois      False
Name: Density, dtype: bool

In [36]:
states.loc[states['Density']>100,['Area','Density']]

            Area     Density
New York  141297  139.076746
Florida   170312  114.806121

In [37]:
states.iloc[0,2]
states

            Population    Area     Density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [38]:
d1=pd.DataFrame([1,2,[3,2],4])
d1

        0
0       1
1       2
2  [3, 2]
3       4

In [39]:
dic1=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})
dic=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]},index=['a','b','c'])
print(dic1)
print('--------')
print(dic)

   a  b
0  1  4
1  2  5
2  3  6
--------
   a  b
a  1  4
b  2  5
c  3  6

In [40]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [41]:
import numpy as np
pd.DataFrame(np.random.rand(3,2),columns=['a','b'],index=[1,2,3])

          a         b
1  0.653941  0.613403
2  0.672401  0.549320
3  0.547953  0.420497

In [42]:
dic1={'a':pd.Series([1,2,3]),'b':pd.Series([4,5,6])}
dic1['c']=pd.Series([7,8,9])
d2=pd.DataFrame(dic1)
d2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [43]:
a=[[1,2,3],[4,5,6],[7,8,9]]
d=pd.DataFrame(a)
d

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [44]:
(d>3) & (d<7)

       0      1      2
0  False  False  False
1   True   True   True
2  False  False  False

In [45]:
d[(d>3) & (d<7)]

     0    1    2
0  NaN  NaN  NaN
1  4.0  5.0  6.0
2  NaN  NaN  NaN

In [46]:
d[[1,2]]

   1  2
0  2  3
1  5  6
2  8  9

In [47]:
d=pd.Series([1,2,3,4],index=['a','b','c','d'])
d

a    1
b    2
c    3
d    4
dtype: int64

In [48]:
d.loc['a':'c']

a    1
b    2
c    3
dtype: int64

In [49]:
d.iloc[1]

2

In [50]:
d.iloc[1:4]

b    2
c    3
d    4
dtype: int64

In [51]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
 'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
 'New York': 19651127}, name='population')
area/population

Alaska             NaN
California    0.011060
New York           NaN
Texas         0.026303
dtype: float64

In [52]:
area.index.union(population.index)

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [53]:
s1 = pd.Series([1, 2, 3], name='Column1')
s2 = pd.Series([4, 5, 6], name='Column2')

# Combining Series into a DataFrame
pd.concat([s1, s2], axis=1)

   Column1  Column2
0        1        4
1        2        5
2        3        6

In [54]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])

In [55]:
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [56]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [57]:
c=pd.concat([A,B],axis=1,keys=['A','B'])
c

     A    B
0  2.0  NaN
1  4.0  1.0
2  6.0  3.0
3  NaN  5.0

In [58]:
c['C']=c['A']+c['B']
c

     A    B    C
0  2.0  NaN  NaN
1  4.0  1.0  5.0
2  6.0  3.0  9.0
3  NaN  5.0  NaN

In [59]:
c.isnull()

       A      B      C
0  False   True   True
1  False  False  False
2  False  False  False
3   True  False   True

In [60]:
c.notnull()

       A      B      C
0   True  False  False
1   True   True   True
2   True   True   True
3  False   True  False

In [61]:
c.dropna()

     A    B    C
1  4.0  1.0  5.0
2  6.0  3.0  9.0

In [62]:
c.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [63]:
c.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [64]:
c.dropna(thresh=3)

     A    B    C
1  4.0  1.0  5.0
2  6.0  3.0  9.0

In [65]:
c.fillna(0)

     A    B    C
0  2.0  0.0  0.0
1  4.0  1.0  5.0
2  6.0  3.0  9.0
3  0.0  5.0  0.0

In [66]:
c.ffill()

     A    B    C
0  2.0  NaN  NaN
1  4.0  1.0  5.0
2  6.0  3.0  9.0
3  6.0  5.0  9.0

In [67]:
c.bfill()

     A    B    C
0  2.0  1.0  5.0
1  4.0  1.0  5.0
2  6.0  3.0  9.0
3  NaN  5.0  NaN

In [68]:
c.bfill(axis=1)

     A    B    C
0  2.0  NaN  NaN
1  4.0  1.0  5.0
2  6.0  3.0  9.0
3  5.0  5.0  NaN

In [69]:
arr=np.array([[3, 8, 2, 4],
 [2, 6, 4, 8],
 [6, 1, 3, 8]])

In [70]:
ab=pd.DataFrame(arr,columns=list('ABCD'))
ab

   A  B  C  D
0  3  8  2  4
1  2  6  4  8
2  6  1  3  8

In [71]:
ab.subtract(ab['B'],axis=0)

   A  B  C  D
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [72]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 2, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
2    E
6    F
dtype: object

In [73]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 2, 6])
pd.concat([ser1, ser2],ignore_index=True)

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [74]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 2, 6])
pd.concat([ser1, ser2],keys=[1,2])

1  1    A
   2    B
   3    C
2  4    D
   2    E
   6    F
dtype: object

In [75]:
ser1 = pd.Series(['A', 'B', 'C'])
ser2 = pd.Series(['D', 'E', 'F'])
pd.concat([ser1, ser2],keys=[1,2],axis=1)

   1  2
0  A  D
1  B  E
2  C  F

In [76]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
 'hire_date': [2004, 2008, 2012, 2014]})

In [77]:
df3=pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [78]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
 'supervisor': ['Carly', 'Guido', 'Steve']})

In [79]:
df5=pd.merge(df3,df4)
df5

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [80]:
df6 = pd.DataFrame({'group': ['Accounting', 'Accounting',
 'Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux',
 'spreadsheets', 'organization']})

In [81]:
pd.merge(df5,df6)

  employee        group  hire_date supervisor        skills
0      Bob   Accounting       2008      Carly          math
1      Bob   Accounting       2008      Carly  spreadsheets
2     Jake  Engineering       2012      Guido        coding
3     Jake  Engineering       2012      Guido         linux
4     Lisa  Engineering       2004      Guido        coding
5     Lisa  Engineering       2004      Guido         linux
6      Sue           HR       2014      Steve  spreadsheets
7      Sue           HR       2014      Steve  organization

In [82]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [83]:
df7 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'salary': [70000, 80000, 120000, 90000]})

In [84]:
pd.merge(df1,df7, left_on='employee', right_on='name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [85]:
pd.merge(df1,df7, left_on='employee', right_on='name').drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [86]:
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [87]:
pd.merge(df1a,df2a,right_index=True,left_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [88]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [89]:
pd.merge(df1a, df7, left_index=True, right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [90]:
df6a = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
 'food': ['fish', 'beans', 'bread']})
df7a = pd.DataFrame({'name': ['Mary', 'Joseph'],
 'drink': ['wine', 'beer']})

In [91]:
pd.merge(df6a,df7a)        #default how=inner

   name   food drink
0  Mary  bread  wine

In [92]:
pd.merge(df6a,df7a,how='outer')

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

In [93]:
pd.merge(df6a,df7a,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [94]:
pd.merge(df6a,df7a,how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [95]:
df8a = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'rank': [1, 2, 3, 4]})
df9a = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'rank': [3, 1, 4, 2]})

In [96]:
pd.merge(df8a,df9a,on='name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [97]:
pd.merge(df8a,df9a,on='rank',suffixes=['_L','_R'])

  name_L  rank name_R
0    Bob     1   Jake
1   Jake     2    Sue
2   Lisa     3    Bob
3    Sue     4   Lisa

In [98]:
abb=pd.read_csv("D:/state-abbrevs.csv")
abb

                   state abbreviation
0                Alabama           AL
1                 Alaska           AK
2                Arizona           AZ
3               Arkansas           AR
4             California           CA
5               Colorado           CO
6            Connecticut           CT
7               Delaware           DE
8   District of Columbia           DC
9                Florida           FL
10               Georgia           GA
11                Hawaii           HI
12                 Idaho           ID
13              Illinois           IL
14               Indiana           IN
15                  Iowa           IA
16                Kansas           KS
17              Kentucky           KY
18             Louisiana           LA
19                 Maine           ME
20               Montana           MT
21              Nebraska           NE
22                Nevada           NV
23         New Hampshire           NH
24            New Jersey           NJ
25            New Mexico           NM
26              New York           NY
27        North Carolina           NC
28          North Dakota           ND
29                  Ohio           OH
30              Oklahoma           OK
31                Oregon           OR
32              Maryland           MD
33         Massachusetts           MA
34              Michigan           MI
35             Minnesota           MN
36           Mississippi           MS
37              Missouri           MO
38          Pennsylvania           PA
39          Rhode Island           RI
40        South Carolina           SC
41          South Dakota           SD
42             Tennessee           TN
43                 Texas           TX
44                  Utah           UT
45               Vermont           VT
46              Virginia           VA
47            Washington           WA
48         West Virginia           WV
49             Wisconsin           WI
50               Wyoming           WY

In [99]:
ars=pd.read_csv("D:/state-areas.csv")
ars

                   state  area (sq. mi)
0                Alabama          52423
1                 Alaska         656425
2                Arizona         114006
3               Arkansas          53182
4             California         163707
5               Colorado         104100
6            Connecticut           5544
7               Delaware           1954
8                Florida          65758
9                Georgia          59441
10                Hawaii          10932
11                 Idaho          83574
12              Illinois          57918
13               Indiana          36420
14                  Iowa          56276
15                Kansas          82282
16              Kentucky          40411
17             Louisiana          51843
18                 Maine          35387
19              Maryland          12407
20         Massachusetts          10555
21              Michigan          96810
22             Minnesota          86943
23           Mississippi          48434
24              Missouri          69709
25               Montana         147046
26              Nebraska          77358
27                Nevada         110567
28         New Hampshire           9351
29            New Jersey           8722
30            New Mexico         121593
31              New York          54475
32        North Carolina          53821
33          North Dakota          70704
34                  Ohio          44828
35              Oklahoma          69903
36                Oregon          98386
37          Pennsylvania          46058
38          Rhode Island           1545
39        South Carolina          32007
40          South Dakota          77121
41             Tennessee          42146
42                 Texas         268601
43                  Utah          84904
44               Vermont           9615
45              Virginia          42769
46            Washington          71303
47         West Virginia          24231
48             Wisconsin          65503
49               Wyoming          97818
50  District of Columbia             68
51           Puerto Rico           3515

In [100]:
pops=pd.read_csv("D:/state-population.csv")
pops

     state/region     ages  year   population
0              AL  under18  2012    1117489.0
1              AL    total  2012    4817528.0
2              AL  under18  2010    1130966.0
3              AL    total  2010    4785570.0
4              AL  under18  2011    1125763.0
...           ...      ...   ...          ...
2539          USA    total  2010  309326295.0
2540          USA  under18  2011   73902222.0
2541          USA    total  2011  311582564.0
2542          USA  under18  2012   73708179.0
2543          USA    total  2012  313873685.0

[2544 rows x 4 columns]

In [101]:
m=pd.merge(pops,abb,how='outer',left_on='state/region',right_on='abbreviation')
m

     state/region     ages  year  population    state abbreviation
0              AK    total  1990    553290.0   Alaska           AK
1              AK  under18  1990    177502.0   Alaska           AK
2              AK    total  1992    588736.0   Alaska           AK
3              AK  under18  1991    182180.0   Alaska           AK
4              AK  under18  1992    184878.0   Alaska           AK
...           ...      ...   ...         ...      ...          ...
2539           WY  under18  1993    137458.0  Wyoming           WY
2540           WY    total  1991    459260.0  Wyoming           WY
2541           WY  under18  1991    136720.0  Wyoming           WY
2542           WY  under18  1990    136078.0  Wyoming           WY
2543           WY    total  1990    453690.0  Wyoming           WY

[2544 rows x 6 columns]

In [102]:
m = m.drop('abbreviation', axis=1)
m

     state/region     ages  year  population    state
0              AK    total  1990    553290.0   Alaska
1              AK  under18  1990    177502.0   Alaska
2              AK    total  1992    588736.0   Alaska
3              AK  under18  1991    182180.0   Alaska
4              AK  under18  1992    184878.0   Alaska
...           ...      ...   ...         ...      ...
2539           WY  under18  1993    137458.0  Wyoming
2540           WY    total  1991    459260.0  Wyoming
2541           WY  under18  1991    136720.0  Wyoming
2542           WY  under18  1990    136078.0  Wyoming
2543           WY    total  1990    453690.0  Wyoming

[2544 rows x 5 columns]

In [103]:
m.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [104]:
m[m['population'].isnull()]

     state/region     ages  year  population state
1872           PR  under18  1990         NaN   NaN
1873           PR    total  1990         NaN   NaN
1874           PR    total  1991         NaN   NaN
1875           PR  under18  1991         NaN   NaN
1876           PR    total  1993         NaN   NaN
1877           PR  under18  1993         NaN   NaN
1878           PR  under18  1992         NaN   NaN
1879           PR    total  1992         NaN   NaN
1880           PR  under18  1994         NaN   NaN
1881           PR    total  1994         NaN   NaN
1882           PR    total  1995         NaN   NaN
1883           PR  under18  1995         NaN   NaN
1884           PR  under18  1996         NaN   NaN
1885           PR    total  1996         NaN   NaN
1886           PR  under18  1998         NaN   NaN
1887           PR    total  1998         NaN   NaN
1888           PR    total  1997         NaN   NaN
1889           PR  under18  1997         NaN   NaN
1890           PR    total  1999         NaN   NaN
1891           PR  under18  1999         NaN   NaN

In [105]:
m.loc[m['state'].isnull(),'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [106]:
m.loc[m['state/region'] == 'PR', 'state'] = 'Puerto Rico'
m.loc[m['state/region'] == 'USA', 'state'] = 'United States'
m.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [107]:
m1=pd.merge(m,ars,on='state',how='left')
m1

     state/region     ages  year  population    state  area (sq. mi)
0              AK    total  1990    553290.0   Alaska       656425.0
1              AK  under18  1990    177502.0   Alaska       656425.0
2              AK    total  1992    588736.0   Alaska       656425.0
3              AK  under18  1991    182180.0   Alaska       656425.0
4              AK  under18  1992    184878.0   Alaska       656425.0
...           ...      ...   ...         ...      ...            ...
2539           WY  under18  1993    137458.0  Wyoming        97818.0
2540           WY    total  1991    459260.0  Wyoming        97818.0
2541           WY  under18  1991    136720.0  Wyoming        97818.0
2542           WY  under18  1990    136078.0  Wyoming        97818.0
2543           WY    total  1990    453690.0  Wyoming        97818.0

[2544 rows x 6 columns]

In [108]:
m1.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [109]:
m1['state'][m1['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [110]:
m1.dropna(inplace=True)

In [111]:
'United States' in m1['state']

False

In [112]:
m1.query("year=='2010' & ages=='total'")

Empty DataFrame
Columns: [state/region, ages, year, population, state, area (sq. mi)]
Index: []

In [113]:
m1.set_index('state',inplace=True)
density=m1['population']/m1['area (sq. mi)']
density.sort_values(ascending=False,inplace=True)
density.head()

state
District of Columbia    9506.602941
District of Columbia    9315.102941
District of Columbia    9112.117647
District of Columbia    8901.779412
District of Columbia    8898.897059
dtype: float64

In [114]:
import seaborn as sns
pt=sns.load_dataset('planets')
pt.shape

(1035, 6)

In [115]:
pt

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [116]:
pt['distance'].sum()

213367.98000000004

In [117]:
pt['distance'].mean()

264.06928217821786

In [118]:
pt.describe().dropna()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [119]:
pt.sum()

method            Radial VelocityRadial VelocityRadial VelocityR...
number                                                         1848
orbital_period                                       1986894.255326
mass                                                     1353.37638
distance                                                  213367.98
year                                                        2079388
dtype: object

In [120]:
pt.min()

method            Astrometry
number                     1
orbital_period      0.090706
mass                  0.0036
distance                1.35
year                    1989
dtype: object

In [121]:
pt['distance'].std()

733.1164929404422

In [122]:
pt['mass'].prod()

9.626219331277315e-60

In [123]:
import pandas as pd
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)})

In [124]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [125]:
pt.groupby('method').sum()

,number,orbital_period,mass,distance,year
method,,,,,
Astrometry,2,1.262360e+03,0.00000,35.75,4023
Eclipse Timing Variations,15,4.276480e+04,10.25000,1261.44,18090
Imaging,50,1.418973e+06,0.00000,2166.91,76347
Microlensing,27,2.207500e+04,0.00000,41440.00,46225
Orbital Brightness Modulation,5,2.127920e+00,0.00000,2360.00,6035
Pulsar Timing,11,3.671511e+04,0.00000,1200.00,9992
Pulsation Timing Variations,1,1.170000e+03,0.00000,0.00,2007
Radial Velocity,952,4.553151e+05,1341.65638,27348.11,1110158
Transit,776,8.377523e+03,1.47000,134242.77,798461
Transit Timing Variations,9,2.393505e+02,0.00000,3313.00,8050

In [126]:
pt.groupby('method')['distance'].median()

method
Astrometry                         17.875
Eclipse Timing Variations         315.360
Imaging                            40.395
Microlensing                     3840.000
Orbital Brightness Modulation    1180.000
Pulsar Timing                    1200.000
Pulsation Timing Variations           NaN
Radial Velocity                    40.445
Transit                           341.000
Transit Timing Variations         855.000
Name: distance, dtype: float64

In [127]:
for (method, group) in pt.groupby('method'):
    print(f"{method}   shape={group.shape}")

Astrometry   shape=(2, 6)
Eclipse Timing Variations   shape=(9, 6)
Imaging   shape=(38, 6)
Microlensing   shape=(23, 6)
Orbital Brightness Modulation   shape=(3, 6)
Pulsar Timing   shape=(5, 6)
Pulsation Timing Variations   shape=(1, 6)
Radial Velocity   shape=(553, 6)
Transit   shape=(397, 6)
Transit Timing Variations   shape=(4, 6)

In [128]:
pt.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [129]:
import numpy as np
pt.groupby('method').aggregate([min,max,np.median])

C:\Users\HP\AppData\Local\Temp\ipykernel_8968\4054179810.py:2: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  pt.groupby('method').aggregate([min,max,np.median])
C:\Users\HP\AppData\Local\Temp\ipykernel_8968\4054179810.py:2: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  pt.groupby('method').aggregate([min,max,np.median])
C:\Users\HP\AppData\Local\Temp\ipykernel_8968\4054179810.py:2: FutureWarning: The provided callable <function median at 0x00000242D6F2AA20> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  pt.groupby('method').aggregate([min,max,np.median])
C:\Users\HP\AppData\Local\Temp\ipykernel_8968\4054179810.py:2: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  pt.groupby('method').aggregate([min,max,np.median])

                              number            orbital_period                 \
                                 min max median            min            max
method
Astrometry                         1   1    1.0     246.360000    1016.000000
Eclipse Timing Variations          1   2    2.0    1916.250000   10220.000000
Imaging                            1   4    1.0    4639.150000  730000.000000
Microlensing                       1   2    1.0    1825.000000    5100.000000
Orbital Brightness Modulation      1   2    2.0       0.240104       1.544929
Pulsar Timing                      1   3    3.0       0.090706   36525.000000
Pulsation Timing Variations        1   1    1.0    1170.000000    1170.000000
Radial Velocity                    1   6    1.0       0.736540   17337.500000
Transit                            1   7    1.0       0.355000     331.600590
Transit Timing Variations          2   3    2.0      22.339500     160.000000

                                               mass               distance  \
                                     median     min    max median      min
method
Astrometry                       631.180000     NaN    NaN    NaN    14.98
Eclipse Timing Variations       4343.500000  4.2000   6.05  5.125   130.72
Imaging                        27500.000000     NaN    NaN    NaN     7.69
Microlensing                    3300.000000     NaN    NaN    NaN  1760.00
Orbital Brightness Modulation      0.342887     NaN    NaN    NaN  1180.00
Pulsar Timing                     66.541900     NaN    NaN    NaN  1200.00
Pulsation Timing Variations     1170.000000     NaN    NaN    NaN      NaN
Radial Velocity                  360.200000  0.0036  25.00  1.260     1.35
Transit                            5.714932  1.4700   1.47  1.470    38.00
Transit Timing Variations         57.011000     NaN    NaN    NaN   339.00

                                                  year
                                   max    median   min   max  median
method
Astrometry                       20.77    17.875  2010  2013  2011.5
Eclipse Timing Variations       500.00   315.360  2008  2012  2010.0
Imaging                         165.00    40.395  2004  2013  2009.0
Microlensing                   7720.00  3840.000  2004  2013  2010.0
Orbital Brightness Modulation  1180.00  1180.000  2011  2013  2011.0
Pulsar Timing                  1200.00  1200.000  1992  2011  1994.0
Pulsation Timing Variations        NaN       NaN  2007  2007  2007.0
Radial Velocity                 354.00    40.445  1989  2014  2009.0
Transit                        8500.00   341.000  2002  2014  2012.0
Transit Timing Variations      2119.00   855.000  2011  2014  2012.5

In [130]:
pt.groupby('method').agg({'number':'min','year':'min'})

                               number  year
method
Astrometry                          1  2010
Eclipse Timing Variations           1  2008
Imaging                             1  2004
Microlensing                        1  2004
Orbital Brightness Modulation       1  2011
Pulsar Timing                       1  1992
Pulsation Timing Variations         1  2007
Radial Velocity                     1  1989
Transit                             1  2002
Transit Timing Variations           2  2011

In [131]:
pt.groupby('method').transform(lambda x: x-x.mean())

        number  orbital_period       mass    distance      year
0    -0.721519     -554.054680   4.469301   25.799792 -1.518987
1    -0.721519       51.419320  -0.420699    5.349792  0.481013
2    -0.721519      -60.354680  -0.030699  -31.760208  3.481013
3    -0.721519     -497.324680  16.769301   59.019792 -0.518987
4    -0.721519     -307.134680   7.869301   67.869792  1.481013
...        ...             ...        ...         ...       ...
1030 -0.954660      -17.160566        NaN -427.298080 -5.236776
1031 -0.954660      -18.486209        NaN -451.298080 -4.236776
1032 -0.954660      -17.910549        NaN -425.298080 -4.236776
1033 -0.954660      -16.976990        NaN -306.298080 -3.236776
1034 -0.954660      -16.914316        NaN -339.298080 -3.236776

[1035 rows x 5 columns]

In [132]:
pt.groupby('method').apply(lambda x:(x['mass']/x['distance']).dropna())

C:\Users\HP\AppData\Local\Temp\ipykernel_8968\4172370535.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  pt.groupby('method').apply(lambda x:(x['mass']/x['distance']).dropna())

method
Radial Velocity  0      0.091731
                 1      0.038806
                 2      0.131048
                 3      0.175375
                 4      0.087888
                          ...
                 640    0.140940
                 641    0.024022
                 642    0.112529
                 784    0.007015
Transit          649    0.008258
Length: 498, dtype: float64

In [133]:
decade=10*(pt['year']//10)
decade.name='decade'
pt.groupby(['method',decade])['number'].sum().unstack().fillna(0)

decade                         1980  1990   2000   2010
method
Astrometry                      0.0   0.0    0.0    2.0
Eclipse Timing Variations       0.0   0.0    5.0   10.0
Imaging                         0.0   0.0   29.0   21.0
Microlensing                    0.0   0.0   12.0   15.0
Orbital Brightness Modulation   0.0   0.0    0.0    5.0
Pulsar Timing                   0.0   9.0    1.0    1.0
Pulsation Timing Variations     0.0   0.0    1.0    0.0
Radial Velocity                 1.0  52.0  475.0  424.0
Transit                         0.0   0.0   64.0  712.0
Transit Timing Variations       0.0   0.0    0.0    9.0

In [134]:
decade=10*(pt['year']//10)
decade.name='decade'
pt.groupby(['method',decade])['number'].sum().unstack().fillna(0)

decade                         1980  1990   2000   2010
method
Astrometry                      0.0   0.0    0.0    2.0
Eclipse Timing Variations       0.0   0.0    5.0   10.0
Imaging                         0.0   0.0   29.0   21.0
Microlensing                    0.0   0.0   12.0   15.0
Orbital Brightness Modulation   0.0   0.0    0.0    5.0
Pulsar Timing                   0.0   9.0    1.0    1.0
Pulsation Timing Variations     0.0   0.0    1.0    0.0
Radial Velocity                 1.0  52.0  475.0  424.0
Transit                         0.0   0.0   64.0  712.0
Transit Timing Variations       0.0   0.0    0.0    9.0

In [135]:
decade=10*(pt['year']//10)
decade.name='Decade'
pt.groupby(['method',decade])['number'].sum().unstack().fillna(0)

Decade                         1980  1990   2000   2010
method
Astrometry                      0.0   0.0    0.0    2.0
Eclipse Timing Variations       0.0   0.0    5.0   10.0
Imaging                         0.0   0.0   29.0   21.0
Microlensing                    0.0   0.0   12.0   15.0
Orbital Brightness Modulation   0.0   0.0    0.0    5.0
Pulsar Timing                   0.0   9.0    1.0    1.0
Pulsation Timing Variations     0.0   0.0    1.0    0.0
Radial Velocity                 1.0  52.0  475.0  424.0
Transit                         0.0   0.0   64.0  712.0
Transit Timing Variations       0.0   0.0    0.0    9.0

In [136]:
import pandas as pd
import numpy as np
import seaborn as sns

tt=sns.load_dataset('titanic')
tt

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [137]:
tt.groupby('sex')[['survived','pclass','age']].median()

        survived  pclass   age
sex
female       1.0     2.0  27.0
male         0.0     3.0  29.0

In [138]:
tt.groupby(['sex','class'])['survived'].mean().unstack().fillna(0)

C:\Users\HP\AppData\Local\Temp\ipykernel_8968\1712326796.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  tt.groupby(['sex','class'])['survived'].mean().unstack().fillna(0)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [139]:
tt.pivot_table('survived',index='sex',columns='class')

C:\Users\HP\AppData\Local\Temp\ipykernel_8968\1344137472.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  tt.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [140]:
f=pd.qcut(tt['fare'],2)       #quantiles
ag=pd.cut(tt['age'],[0,20,80])          #bins
tt.pivot_table('survived',['sex',ag],['class',f]).fillna(0)

C:\Users\HP\AppData\Local\Temp\ipykernel_8968\3663740857.py:3: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  tt.pivot_table('survived',['sex',ag],['class',f]).fillna(0)

class                      First                             Second  \
fare            (-0.001, 14.454] (14.454, 512.329] (-0.001, 14.454]
sex    age
female (0, 20]               0.0          0.928571         1.000000
       (20, 80]              0.0          0.971831         0.880000
male   (0, 20]               0.0          0.571429         0.142857
       (20, 80]              0.0          0.400000         0.083333

class                                        Third
fare            (14.454, 512.329] (-0.001, 14.454] (14.454, 512.329]
sex    age
female (0, 20]           1.000000         0.680000          0.318182
       (20, 80]          0.909091         0.437500          0.391304
male   (0, 20]           0.750000         0.195652          0.200000
       (20, 80]          0.031250         0.124183          0.166667

In [141]:
tt.pivot_table(index='sex', columns='class',
 aggfunc={'survived':sum, 'fare':'mean'})

C:\Users\HP\AppData\Local\Temp\ipykernel_8968\3058926708.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  tt.pivot_table(index='sex', columns='class',
C:\Users\HP\AppData\Local\Temp\ipykernel_8968\3058926708.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  tt.pivot_table(index='sex', columns='class',

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [142]:
tt.pivot_table('survived', index='sex', columns='class', margins=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_8968\3022287960.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  tt.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [143]:
data = ['peter', 'Paul', 'MARY', 'gUIDO']
[s.capitalize() for s in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [144]:
 import pandas as pd
 names = pd.Series(data)
names

0    peter
1     Paul
2     MARY
3    gUIDO
dtype: object

In [145]:
names.str.capitalize()

0    Peter
1     Paul
2     Mary
3    Guido
dtype: object

In [146]:
names.str.len()

0    5
1    4
2    4
3    5
dtype: int64

In [147]:
 from datetime import datetime
 datetime(month=7, year=2015, day=4)

datetime.datetime(2015, 7, 4, 0, 0)

In [148]:
from dateutil import parser
parser.parse( '2015 15th August')

datetime.datetime(2015, 8, 15, 0, 0)

In [149]:
parser.parse( '15th August of 2015')

datetime.datetime(2015, 8, 15, 0, 0)

In [150]:
import datetime as dt
dt.datetime.today().strftime('%A')

'Monday'

In [151]:
import numpy as np
date = np.array('2015-07-04', dtype=np.datetime64)
date

array('2015-07-04', dtype='datetime64[D]')

In [152]:
date+np.arange(12)

array(['2015-07-04', '2015-07-05', '2015-07-06', '2015-07-07',
       '2015-07-08', '2015-07-09', '2015-07-10', '2015-07-11',
       '2015-07-12', '2015-07-13', '2015-07-14', '2015-07-15'],
      dtype='datetime64[D]')

In [153]:
np.datetime64('2015-11-05')

numpy.datetime64('2015-11-05')

In [154]:
np.datetime64('2015-11-05 12:00')

numpy.datetime64('2015-11-05T12:00')

In [155]:
np.datetime64('2015-07-04 12:59:59.50', 'ns')

numpy.datetime64('2015-07-04T12:59:59.500000000')

In [156]:
import pandas as pd
date=pd.to_datetime('4th of june 2015')
date

Timestamp('2015-06-04 00:00:00')

In [157]:
date.strftime('%A')

'Thursday'

In [158]:
date+ pd.to_timedelta(np.arange(12),'d')

DatetimeIndex(['2015-06-04', '2015-06-05', '2015-06-06', '2015-06-07',
               '2015-06-08', '2015-06-09', '2015-06-10', '2015-06-11',
               '2015-06-12', '2015-06-13', '2015-06-14', '2015-06-15'],
              dtype='datetime64[ns]', freq=None)

In [159]:
id=pd.DatetimeIndex(['2015-06-04', '2015-06-05', '2015-06-06', '2015-06-07',
               '2015-06-08', '2015-06-09', '2015-06-10', '2015-06-11',
               '2015-06-12', '2015-06-13', '2015-06-14', '2015-06-15'])
dt=pd.Series([0,1,2,3,4,5,6,7,8,9,10,11],index=id)
dt

2015-06-04     0
2015-06-05     1
2015-06-06     2
2015-06-07     3
2015-06-08     4
2015-06-09     5
2015-06-10     6
2015-06-11     7
2015-06-12     8
2015-06-13     9
2015-06-14    10
2015-06-15    11
dtype: int64

In [160]:
dt['2015-06-12':'2015-06-05':-1]

2015-06-12    8
2015-06-11    7
2015-06-10    6
2015-06-09    5
2015-06-08    4
2015-06-07    3
2015-06-06    2
2015-06-05    1
dtype: int64

In [161]:
dt[-1:5:-1]

2015-06-15    11
2015-06-14    10
2015-06-13     9
2015-06-12     8
2015-06-11     7
2015-06-10     6
dtype: int64

In [162]:
dt['2015']

2015-06-04     0
2015-06-05     1
2015-06-06     2
2015-06-07     3
2015-06-08     4
2015-06-09     5
2015-06-10     6
2015-06-11     7
2015-06-12     8
2015-06-13     9
2015-06-14    10
2015-06-15    11
dtype: int64

In [166]:
dates = pd.to_datetime([datetime.datetime(2015, 7, 3), '4th of July, 2015','2015-Jul-6', '07-07-2015', '20150708'])
dates

AttributeError: type object 'datetime.datetime' has no attribute 'datetime'

In [ ]:
dates.to_period('D')

In [ ]:
dates-dates[0]

In [ ]:
pd.date_range('2015-07-03', '2015-07-10')

In [ ]:
pd.date_range('2015-07-03', '2015-09-10',freq='W')

In [ ]:
pd.date_range('2015-07-03', periods=4,freq='h')

In [ ]:
 pd.period_range('2015-07', periods=8, freq='M')

In [ ]:
pd.timedelta_range(0,periods=5,freq='h')